In [3]:
from sqlalchemy import create_engine, text
import pandas as pd

# ✅ Connect to PostgreSQL (update your password if needed)
engine = create_engine("postgresql+psycopg2://postgres:password@localhost/employee_management")
conn = engine.connect()
print("✅ Connected to PostgreSQL successfully")

✅ Connected to PostgreSQL successfully

In [4]:
conn.execute(text("""
CREATE TABLE IF NOT EXISTS departments (
    dept_id SERIAL PRIMARY KEY,
    dept_name VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE IF NOT EXISTS roles (
    role_id SERIAL PRIMARY KEY,
    role_name VARCHAR(50) NOT NULL UNIQUE
);

CREATE TABLE IF NOT EXISTS employees (
    emp_id SERIAL PRIMARY KEY,
    emp_name VARCHAR(100) NOT NULL,
    email VARCHAR(100) UNIQUE NOT NULL,
    salary NUMERIC(10,2),
    dept_id INT REFERENCES departments(dept_id),
    role_id INT REFERENCES roles(role_id)
);
"""))
print("✅ Tables created successfully")

✅ Tables created successfully

In [6]:
# ---------- CREATE ----------
def add_department(name):
    conn.execute(text("INSERT INTO departments (dept_name) VALUES (:name)"), {"name": name})
    print("✅ Department added successfully")

def add_role(name):
    conn.execute(text("INSERT INTO roles (role_name) VALUES (:name)"), {"name": name})
    print("✅ Role added successfully")

def add_employee(name, email, salary, dept_id, role_id):
    conn.execute(text("""
        INSERT INTO employees (emp_name, email, salary, dept_id, role_id)
        VALUES (:name, :email, :salary, :dept, :role)
    """), {"name": name, "email": email, "salary": salary, "dept": dept_id, "role": role_id})
    print("✅ Employee added successfully")


# ---------- READ ----------
def view_table(table_name):
    df = pd.read_sql(f"SELECT * FROM {table_name}", conn)
    display(df)

def view_all_employees():
    query = """
    SELECT e.emp_id, e.emp_name, e.email, e.salary,
           d.dept_name, r.role_name
    FROM employees e
    JOIN departments d ON e.dept_id = d.dept_id
    JOIN roles r ON e.role_id = r.role_id
    ORDER BY e.emp_id;
    """
    df = pd.read_sql(query, conn)
    display(df)


# ---------- UPDATE ----------
def update_employee_salary(emp_id, new_salary):
    conn.execute(text("UPDATE employees SET salary = :sal WHERE emp_id = :id"),
                 {"sal": new_salary, "id": emp_id})
    print("✅ Salary updated successfully")


# ---------- DELETE ----------
def delete_employee(emp_id):
    conn.execute(text("DELETE FROM employees WHERE emp_id = :id"), {"id": emp_id})
    print("✅ Employee deleted successfully")

In [7]:
# Add sample departments
for dept in ['HR', 'Finance', 'IT', 'Sales']:
    try:
        add_department(dept)
    except:
        pass

# Add sample roles
for role in ['Manager', 'Executive', 'Engineer', 'Analyst']:
    try:
        add_role(role)
    except:
        pass

# Add sample employees
try:
    add_employee('Amit Sharma', 'amit@company.com', 60000, 1, 1)
    add_employee('Priya Mehta', 'priya@company.com', 55000, 2, 2)
    add_employee('Ravi Patel', 'ravi@company.com', 70000, 3, 3)
    add_employee('Neha Joshi', 'neha@company.com', 50000, 4, 4)
except:
    pass

✅ Department added successfully
✅ Department added successfully
✅ Department added successfully
✅ Department added successfully
✅ Role added successfully
✅ Role added successfully
✅ Role added successfully
✅ Role added successfully
✅ Employee added successfully
✅ Employee added successfully
✅ Employee added successfully
✅ Employee added successfully

In [8]:
print("📋 Departments:")
view_table("departments")

print("📋 Roles:")
view_table("roles")

print("📋 Employees:")
view_all_employees()

📋 Departments:

   dept_id dept_name
0        1        HR
1        2   Finance
2        3        IT
3        4     Sales

📋 Roles:

   role_id  role_name
0        1    Manager
1        2  Executive
2        3   Engineer
3        4    Analyst

📋 Employees:

   emp_id     emp_name              email   salary dept_name  role_name
0       1  Amit Sharma   amit@company.com  60000.0        HR    Manager
1       2  Priya Mehta  priya@company.com  55000.0   Finance  Executive
2       3   Ravi Patel   ravi@company.com  70000.0        IT   Engineer
3       4   Neha Joshi   neha@company.com  50000.0     Sales    Analyst

In [9]:
# Update salary of employee with emp_id = 3
update_employee_salary(3, 75000)

# Delete employee with emp_id = 4
delete_employee(4)

# Verify updates
view_all_employees()

✅ Salary updated successfully
✅ Employee deleted successfully

   emp_id     emp_name              email   salary dept_name  role_name
0       1  Amit Sharma   amit@company.com  60000.0        HR    Manager
1       2  Priya Mehta  priya@company.com  55000.0   Finance  Executive
2       3   Ravi Patel   ravi@company.com  75000.0        IT   Engineer

In [ ]:
def menu():
    while True:
        print("\n==== Employee Management System ====")
        print("1. Add Department")
        print("2. Add Role")
        print("3. Add Employee")
        print("4. View All Employees")
        print("5. Update Employee Salary")
        print("6. Delete Employee")
        print("7. Exit")
        
        choice = input("Enter your choice: ")

        if choice == '1':
            name = input("Enter department name: ")
            add_department(name)
        elif choice == '2':
            name = input("Enter role name: ")
            add_role(name)
        elif choice == '3':
            name = input("Enter employee name: ")
            email = input("Enter email: ")
            salary = float(input("Enter salary: "))
            dept = int(input("Enter department ID: "))
            role = int(input("Enter role ID: "))
            add_employee(name, email, salary, dept, role)
        elif choice == '4':
            view_all_employees()
        elif choice == '5':
            emp_id = int(input("Enter employee ID: "))
            salary = float(input("Enter new salary: "))
            update_employee_salary(emp_id, salary)
        elif choice == '6':
            emp_id = int(input("Enter employee ID: "))
            delete_employee(emp_id)
        elif choice == '7':
            print("Exiting system... ✅")
            break
        else:
            print("❌ Invalid choice, please try again.")

menu()

==== Employee Management System ====
1. Add Department
2. Add Role
3. Add Employee
4. View All Employees
5. Update Employee Salary
6. Delete Employee
7. Exit

Enter your choice:  4

   emp_id     emp_name              email   salary dept_name  role_name
0       1  Amit Sharma   amit@company.com  60000.0        HR    Manager
1       2  Priya Mehta  priya@company.com  55000.0   Finance  Executive
2       3   Ravi Patel   ravi@company.com  75000.0        IT   Engineer

==== Employee Management System ====
1. Add Department
2. Add Role
3. Add Employee
4. View All Employees
5. Update Employee Salary
6. Delete Employee
7. Exit